Repository: whit3rabbit/turbospark
Catalog: swift/TurboSparkApp/Localization/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, he, hi, id, it, ja, ko, nl, pl, pt_br, ru, sv, tr, uk, vi, zh_hans, zh_hant

source: View all
ar: عرض الكل
de: Alle anzeigen
es: Ver todo
fr: Tout afficher
he: הצגת הכול
hi: सभी देखें
id: Lihat semua
it: Mostrare tutto
ja: すべて表示
ko: 모두 보기
nl: Alles bekijken
pl: Pokaż wszystko
pt_br: Ver tudo
ru: Показать всё
sv: Visa alla
tr: Tümünü gör
uk: Показати все
vi: Xem tất cả
zh_hans: 查看全部
zh_hant: 檢視全部

source: View all (+%lld characters)
ar: عرض الكل (+%lld حرفًا)
de: Alle anzeigen (+%lld Zeichen)
es: Ver todo (+%lld caracteres)
fr: Tout afficher (+%lld caractères)
he: הצג הכל (+%lld תווים)
hi: सभी देखें (+%lld वर्ण)
id: Lihat semua (+%lld karakter)
it: Mostra tutto (+%lld caratteri)
ja: すべて表示（+%lld 文字）
ko: 모두 보기 (+%lld자)
nl: Alles weergeven (+%lld tekens)
pl: Pokaż wszystko (+%lld znaków)
pt_br: Ver tudo (+%lld caracteres)
ru: Показать всё (+%lld символов)
sv: Visa alla (+%lld tecken)
tr: Tümünü göster (+%lld karakter)
uk: Показати все (+%lld символів)
vi: Xem tất cả (+%lld ký tự)
zh_hans: 显示全部（+%lld 个字符）
zh_hant: 顯示全部（+%lld 個字元）

source: Vocab Size
ar: حجم المفردات
de: Vokabulargröße
es: Tamaño de vocabulario
fr: Taille du vocabulaire
he: גודל אוצר מילים
hi: शब्दावली आकार
id: Ukuran Kosakata
it: Dimensione vocabolario
ja: 語彙サイズ
ko: 어휘 크기
nl: Vocabulairegrootte
pl: Rozmiar słownika
pt_br: Tamanho do Vocabulário
ru: Размер словаря
sv: Vokabulärstorlek
tr: Kelime Dağarcığı Boyutu
uk: Розмір словника
vi: Kích thước từ vựng
zh_hans: 词表大小
zh_hant: 詞彙表大小

source: Vocabulary Size
ar: حجم المفردات
de: Vokabulargröße
es: Tamaño del vocabulario
fr: Taille du vocabulaire
he: גודל אוצר המילים
hi: शब्दावली आकार
id: Ukuran kosakata
it: Dimensione del vocabolario
ja: 語彙サイズ
ko: 어휘 크기
nl: Woordenschatgrootte
pl: Rozmiar słownika
pt_br: Tamanho do vocabulário
ru: Размер словаря
sv: Vokabulärstorlek
tr: Sözcük dağarcığı boyutu
uk: Розмір словника
vi: Kích thước từ vựng
zh_hans: 词表大小
zh_hant: 詞彙表大小

source: Wait
ar: انتظار
de: Warten
es: Esperar
fr: Attendre
he: המתנה
hi: प्रतीक्षा करें
id: Tunggu
it: Attendere
ja: 待機
ko: 대기
nl: Wachten
pl: Czekaj
pt_br: Aguardar
ru: Подождать
sv: Vänta
tr: Bekle
uk: Зачекати
vi: Chờ
zh_hans: 等待
zh_hant: 等待

source: Waiting for background work
ar: في انتظار العمل في الخلفية
de: Warte auf Hintergrundarbeit
es: Esperando trabajo en segundo plano
fr: En attente des tâches de fond
he: ממתין לעבודת רקע
hi: पृष्ठभूमि कार्य की प्रतीक्षा
id: Menunggu pekerjaan latar belakang
it: In attesa del lavoro in background
ja: バックグラウンド処理を待機中
ko: 백그라운드 작업 대기 중
nl: Wachten op achtergrondwerk
pl: Oczekiwanie na zadania w tle
pt_br: Aguardando trabalho em segundo plano
ru: Ожидание фоновых задач
sv: Väntar på bakgrundsarbete
tr: Arka plan işi bekleniyor
uk: Очікування фонових задач
vi: Đang chờ công việc nền
zh_hans: 等待后台任务
zh_hant: 等待背景工作

source: Waiting for image slot
ar: في انتظار فتحة للصورة
de: Warten auf einen Bildplatz
es: Esperando un espacio para imágenes
fr: En attente d'une place pour l'image
he: ממתין למשבצת תמונה
hi: इमेज स्लॉट की प्रतीक्षा
id: Menunggu slot gambar
it: In attesa di uno slot per l'immagine
ja: 画像スロットを待機中
ko: 이미지 슬롯 대기 중
nl: Wachten op een afbeeldingsslot
pl: Oczekiwanie na miejsce obrazu
pt_br: Aguardando espaço para imagem
ru: Ожидание слота для изображения
sv: Väntar på bildplats
tr: Görüntü yuvası bekleniyor
uk: Очікування слота для зображення
vi: Đang chờ khe hình ảnh
zh_hans: 正在等待图像槽位
zh_hant: 正在等待圖像插槽

source: Warning: Context window exceeds trained context
ar: تحذير: نافذة السياق تتجاوز السياق المدرَّب
de: Warnung: Das Kontextfenster überschreitet den trainierten Kontext
es: Advertencia: la ventana de contexto supera el contexto entrenado
fr: Avertissement : la fenêtre de contexte dépasse le contexte d'entraînement
he: אזהרה: חלון ההקשר חורג מההקשר המאומן
hi: चेतावनी: संदर्भ विंडो प्रशिक्षित संदर्भ से अधिक है
id: Peringatan: jendela konteks melebihi konteks terlatih
it: Avviso: la finestra di contesto supera il contesto addestrato
ja: 警告: コンテキストウィンドウが学習済みコンテキストを超えています
ko: 경고: 컨텍스트 윈도우가 학습된 컨텍스트를 초과합니다
nl: Waarschuwing: het contextvenster overschrijdt de getrainde context
pl: Ostrzeżenie: okno kontekstu przekracza wytrenowany kontekst
pt_br: Aviso: a janela de contexto excede o contexto treinado
ru: Предупреждение: окно контекста превышает обученный контекст
sv: Varning: kontextfönstret överskrider den tränade kontexten
tr: Uyarı: Bağlam penceresi eğitilmiş bağlamı aşıyor
uk: Попередження: вікно контексту перевищує натренований контекст
vi: Cảnh báo: cửa sổ ngữ cảnh vượt quá ngữ cảnh đã huấn luyện
zh_hans: 警告: 上下文窗口超出训练上下文
zh_hant: 警告: 上下文視窗超出訓練上下文

source: Welcome back! What are we working on?
ar: مرحبًا بعودتك! على ماذا نعمل؟
de: Willkommen zurück! Woran arbeiten wir?
es: ¡Bienvenido de nuevo! ¿En qué estamos trabajando?
fr: Bon retour ! Sur quoi travaillons-nous ?
he: ברוך שובך! על מה אנחנו עובדים?
hi: वापसी पर स्वागत है! हम किस पर काम कर रहे हैं?
id: Selamat datang kembali! Apa yang sedang kita kerjakan?
it: Bentornato! Su cosa stiamo lavorando?
ja: お帰りなさい！何に取り組みましょうか？
ko: 다시 오신 것을 환영합니다! 어떤 작업을 진행할까요?
nl: Welkom terug! Waar werken we aan?
pl: Witaj z powrotem! Nad czym pracujemy?
pt_br: Bem-vindo de volta! No que estamos trabalhando?
ru: С возвращением! Над чем мы работаем?
sv: Välkommen tillbaka! Vad jobbar vi på?
tr: Tekrar hoş geldiniz! Ne üzerinde çalışıyoruz?
uk: З поверненням! Над чим працюємо?
vi: Chào mừng trở lại! Chúng ta đang làm gì nào?
zh_hans: 欢迎回来！我们接下来做什么？
zh_hant: 歡迎回來！我們接下來做什麼？

source: Welcome to TurboSpark
ar: مرحبا بك في TurboSpark
de: Willkommen bei TurboSpark
es: Te damos la bienvenida a TurboSpark
fr: Bienvenue dans TurboSpark
he: ברוך הבא ל-TurboSpark
hi: TurboSpark में आपका स्वागत है
id: Selamat datang di TurboSpark
it: Ti diamo il benvenuto in TurboSpark
ja: TurboSpark へようこそ
ko: TurboSpark에 오신 것을 환영합니다
nl: Welkom bij TurboSpark
pl: Witamy w TurboSpark
pt_br: Boas-vindas ao TurboSpark
ru: Добро пожаловать в TurboSpark
sv: Välkommen till TurboSpark
tr: TurboSpark'a hoş geldiniz
uk: Ласкаво просимо до TurboSpark
vi: Chào mừng đến với TurboSpark
zh_hans: 欢迎使用 TurboSpark
zh_hant: 歡迎使用 TurboSpark

source: Welcome to TurboSpark!
ar: مرحبًا بك في TurboSpark!
de: Willkommen bei TurboSpark!
es: ¡Bienvenido a TurboSpark!
fr: Bienvenue sur TurboSpark !
he: ברוכים הבאים ל-TurboSpark!
hi: TurboSpark में आपका स्वागत है!
id: Selamat datang di TurboSpark!
it: Benvenuto in TurboSpark!
ja: TurboSparkへようこそ！
ko: TurboSpark에 오신 것을 환영합니다!
nl: Welkom bij TurboSpark!
pl: Witamy w TurboSpark!
pt_br: Bem-vindo ao TurboSpark!
ru: Добро пожаловать в TurboSpark!
sv: Välkommen till TurboSpark!
tr: TurboSpark'a Hoş Geldiniz!
uk: Ласкаво просимо до TurboSpark!
vi: Chào mừng bạn đến với TurboSpark!
zh_hans: 欢迎使用 TurboSpark！
zh_hant: 歡迎使用 TurboSpark！

source: Welcome!
ar: أهلاً وسهلاً!
de: Willkommen!
es: ¡Bienvenido!
fr: Bienvenue !
he: ברוכים הבאים!
hi: स्वागत है!
id: Selamat datang!
it: Benvenuto!
ja: ようこそ！
ko: 환영합니다!
nl: Welkom!
pl: Witaj!
pt_br: Bem-vindo!
ru: Добро пожаловать!
sv: Välkommen!
tr: Hoş Geldiniz!
uk: Ласкаво просимо!
vi: Chào mừng!
zh_hans: 欢迎！
zh_hant: 歡迎！

source: What This Project Remembers
ar: ما يتذكره هذا المشروع
de: Worüber sich dieses Projekt erinnert
es: Lo que recuerda este proyecto
fr: Ce dont ce projet se souvient
he: מה הפרויקט הזה זוכר
hi: यह परियोजना क्या याद रखती है
id: Apa yang Diingat Proyek Ini
it: Cosa ricorda questo progetto
ja: このプロジェクトが記憶していること
ko: 이 프로젝트가 기억하는 내용
nl: Wat dit project zich herinnert
pl: Co pamięta ten projekt
pt_br: O que este projeto lembra
ru: Что помнит этот проект
sv: Vad detta projekt minns
tr: Bu Projenin Hatırladıkları
uk: Що пам'ятає цей проект
vi: Những gì dự án này ghi nhớ
zh_hans: 此项目记住的内容
zh_hant: 此專案記住的內容

source: What is on your mind today?
ar: ما الذي يدور في ذهنك اليوم؟
de: Was beschäftigt Sie heute?
es: ¿En qué estás pensando hoy?
fr: À quoi pensez-vous aujourd'hui ?
he: על מה אתה חושב היום?
hi: आज आपके मन में क्या है?
id: Apa yang ada di pikiran Anda hari ini?
it: A cosa stai pensando oggi?
ja: 今日のご用件は何ですか？
ko: 오늘 어떤 생각이 있으신가요?
nl: Wat houdt je vandaag bezig?
pl: O czym myślisz dzisiaj?
pt_br: O que está pensando hoje?
ru: О чем вы думаете сегодня?
sv: Vad har du på hjärtat idag?
tr: Bugün aklınızda ne var?
uk: Що у вас на думці сьогодні?
vi: Hôm nay bạn đang suy nghĩ điều gì?
zh_hans: 今天有什么想法？
zh_hant: 今天有什麼想法？

source: What this is
ar: ما هذا
de: Worum es sich handelt
es: De qué se trata
fr: De quoi il s'agit
he: מה זה
hi: यह क्या है
id: Apa ini
it: Di cosa si tratta
ja: 概要
ko: 개요
nl: Wat dit is
pl: O co chodzi
pt_br: O que é isso
ru: Что это такое
sv: Vad detta är
tr: Bu nedir
uk: Що це таке
vi: Đây là gì
zh_hans: 功能说明
zh_hant: 功能說明

source: What this server does not do
ar: ما لا يفعله هذا الخادم
de: Was dieser Server nicht tut
es: Lo que este servidor no hace
fr: Ce que ce serveur ne fait pas
he: מה השרת הזה לא עושה
hi: यह सर्वर क्या नहीं करता
id: Yang tidak dilakukan server ini
it: Cosa non fa questo server
ja: このサーバーが行わないこと
ko: 이 서버가 하지 않는 일
nl: Wat deze server niet doet
pl: Czego ten serwer nie robi
pt_br: O que este servidor não faz
ru: Чего этот сервер не делает
sv: Vad den här servern inte gör
tr: Bu sunucunun yapmadıkları
uk: Чого цей сервер не робить
vi: Những gì máy chủ này không làm
zh_hans: 此服务器不做什么
zh_hant: 此伺服器不做什麼

source: What to Include in This Backup
ar: ما يجب تضمينه في هذه النسخة الاحتياطية
de: Was soll in dieses Backup aufgenommen werden?
es: Qué incluir en esta copia de seguridad
fr: Quoi inclure dans cette sauvegarde
he: מה לכלול בגיבוי הזה
hi: इस बैकअप में क्या शामिल करें
id: Apa yang Disertakan dalam Cadangan Ini
it: Cosa includere in questo backup
ja: このバックアップに含める内容
ko: 이 백업에 포함할 항목
nl: Wat wil je in deze back-up opnemen
pl: Co uwzględnić w tej kopii zapasowej
pt_br: O que incluir neste backup
ru: Что включить в эту резервную копию
sv: Vad som ska ingå i säkerhetskopian
tr: Bu Yedeğe Neler Dahil Edilsin
uk: Що включити до цієї резервної копії
vi: Những gì cần đưa vào bản sao lưu này
zh_hans: 此备份要包含哪些内容
zh_hant: 此備份要包含哪些內容

source: What would you like to build or explore?
ar: ماذا تود أن تبني أو تستكشف؟
de: Was möchten Sie erstellen oder erkunden?
es: ¿Qué te gustaría construir o explorar?
fr: Que souhaitez-vous créer ou explorer ?
he: מה תרצה לבנות או לחקור?
hi: आप क्या बनाना या खोजना चाहते हैं?
id: Apa yang ingin Anda buat atau jelajahi?
it: Cosa vorresti costruire o esplorare?
ja: 何を作成または探索したいですか？
ko: 무엇을 만들거나 탐색하고 싶으신가요?
nl: Wat wil je bouwen of ontdekken?
pl: Co chciałbyś zbudować lub odkryć?
pt_br: O que você gostaria de construir ou explorar?
ru: Что бы вы хотели создать или исследовать?
sv: Vad vill du bygga eller utforska?
tr: Ne oluşturmak veya keşfetmek istersiniz?
uk: Що б ви хотіли створити чи дослідити?
vi: Bạn muốn xây dựng hoặc khám phá điều gì?
zh_hans: 您想构建或探索什么？
zh_hant: 您想要建構或探索什麼？

source: When enabled, closing the main window leaves the server and menu bar active. Use Quit TurboSpark from the menu bar or Command-Q to exit.
ar: عند التمكين، يؤدي إغلاق النافذة الرئيسية إلى ترك الخادم وشريط القوائم نشطين. استخدم إنهاء TurboSpark من شريط القوائم أو Command-Q للخروج.
de: Wenn aktiviert, bleibt der Server und die Menüleiste aktiv, wenn das Hauptfenster geschlossen wird. Verwenden Sie TurboSpark beenden in der Menüleiste oder Befehl-Q zum Beenden.
es: Cuando está habilitado, cerrar la ventana principal deja activos el servidor y la barra de menús. Usa Salir de TurboSpark en la barra de menús o Comando-Q para salir.
fr: Lorsqu'elle est activée, la fermeture de la fenêtre principale laisse le serveur et la barre de menus actifs. Utilisez Quitter TurboSpark dans la barre de menus ou Commande-Q pour quitter.
he: כאשר מופעל, סגירת החלון הראשי משאירה את השרת ושורת התפריטים פעילים. השתמש ביציאה מ-TurboSpark משורת התפריטים או ב-Command-Q כדי לצאת.
hi: सक्षम होने पर, मुख्य विंडो को बंद करने से सर्वर और मेनू बार सक्रिय रहते हैं। बाहर निकलने के लिए मेनू बार से TurboSpark छोड़ें या Command-Q का उपयोग करें।
id: Saat diaktifkan, menutup jendela utama akan membiarkan server dan bilah menu tetap aktif. Gunakan Keluar dari TurboSpark dari bilah menu atau Command-Q untuk keluar.
it: Quando abilitato, la chiusura della finestra principale lascia attivi il server e la barra dei menu. Usa Esci da TurboSpark dalla barra dei menu o Comando-Q per uscire.
ja: 有効にすると、メインウィンドウを閉じてもサーバーとメニューバーがアクティブのままになります。終了するにはメニューバーの [TurboSpark を終了] または Command-Q を使用してください。
ko: 활성화하면 메인 창을 닫아도 서버와 메뉴 막대가 활성 상태로 유지됩니다. 종료하려면 메뉴 막대에서 TurboSpark 종료를 사용하거나 Command-Q를 누르세요.
nl: Indien ingeschakeld, laat het sluiten van het hoofdvenster de server en menubalk actief. Gebruik TurboSpark stoppen in de menubalk of Command-Q om af te sluiten.
pl: Gdy ta opcja jest włączona, zamknięcie głównego okna pozostawia serwer i pasek menu aktywnymi. Użyj opcji Zakończ TurboSpark z paska menu lub skrótu Command-Q, aby wyjść.
pt_br: Quando ativado, fechar a janela principal mantém o servidor e a barra de menus ativos. Use Encerrar TurboSpark na barra de menus ou Command-Q para sair.
ru: Если включено, закрытие главного окна оставляет сервер и строку меню активными. Используйте пункт «Завершить TurboSpark» в строке меню или Command-Q для выхода.
sv: När den är aktiverad lämnar stängning av huvudfönstret servern och menyraden aktiva. Använd Avsluta TurboSpark från menyraden eller Command-Q för att avsluta.
tr: Etkinleştirildiğinde, ana pencerenin kapatılması sunucuyu ve menü çubuğunu etkin bırakır. Çıkmak için menü çubuğundan TurboSpark'tan Çık'ı veya Command-Q'yu kullanın.
uk: Якщо ввімкнено, закриття головного вікна залишає сервер і рядок меню активними. Використовуйте пункт «Завершити TurboSpark» у рядку меню або Command-Q для виходу.
vi: Khi được bật, việc đóng cửa sổ chính vẫn giữ cho máy chủ và thanh menu hoạt động. Sử dụng Thoát TurboSpark từ thanh menu hoặc Command-Q để thoát.
zh_hans: 启用后，关闭主窗口仍会保持服务器和菜单栏处于活动状态。从菜单栏中选择“退出 TurboSpark”或使用 Command-Q 退出。
zh_hant: 啟用後，關閉主視窗仍會保持伺服器和選單列處於活動狀態。從選單列中選擇「結束 TurboSpark」或使用 Command-Q 退出。

source: Width
ar: العرض
de: Breite
es: Ancho
fr: Largeur
he: רוחב
hi: चौड़ाई
id: Lebar
it: Larghezza
ja: 幅
ko: 너비
nl: Breedte
pl: Szerokość
pt_br: Largura
ru: Ширина
sv: Bredd
tr: Genişlik
uk: Ширина
vi: Chiều rộng
zh_hans: 宽度
zh_hant: 寬度

source: Windows past the trained one still load. Quality beyond it is the checkpoint's business, not this engine's.
ar: النوافذ التي تتجاوز نافذة التدريب تُحمَّل أيضًا. الجودة بعدها شأن نقطة التحقق، لا شأن هذا المحرك.
de: Fenster über dem trainierten laden trotzdem. Die Qualität darüber hinaus ist Sache des Checkpoints, nicht dieser Engine.
es: Las ventanas mayores que la entrenada se cargan igualmente. La calidad más allá de ese punto depende del checkpoint, no de este motor.
fr: Les fenêtres au-delà de celle d'entraînement se chargent quand même. La qualité au-delà relève du checkpoint, pas de ce moteur.
he: חלונות מעבר לזה שאומן ייטענו בכל זאת. האיכות מעבר לכך היא עניינה של נקודת הבדיקה, לא של המנוע הזה.
hi: प्रशिक्षित विंडो से बड़ी विंडो भी लोड होती हैं। उसके आगे की गुणवत्ता चेकपॉइंट का मामला है, इस इंजन का नहीं।
id: Jendela di atas yang dilatih tetap dimuat. Kualitas di luar itu urusan checkpoint, bukan mesin ini.
it: Le finestre oltre quella addestrata si caricano comunque. La qualità oltre quel punto dipende dal checkpoint, non da questo motore.
ja: 学習時のウィンドウを超えても読み込めます。それを超えた品質はチェックポイント側の問題で、このエンジンの問題ではありません。
ko: 학습된 창을 넘는 값도 로드됩니다. 그 이상의 품질은 이 엔진이 아니라 체크포인트의 몫입니다.
nl: Vensters voorbij het getrainde laden gewoon. De kwaliteit daarbuiten is een zaak van het checkpoint, niet van deze engine.
pl: Okna większe niż wytrenowane też się wczytają. Jakość powyżej zależy od checkpointu, nie od tego silnika.
pt_br: Janelas além da treinada carregam mesmo assim. A qualidade além dela é assunto do checkpoint, não deste motor.
ru: Окна больше обученного всё равно загружаются. Качество за его пределами зависит от чекпоинта, а не от этого движка.
sv: Fönster bortom det tränade laddas ändå. Kvaliteten därutöver är checkpointens sak, inte den här motorns.
tr: Eğitilen pencerenin ötesindeki değerler de yüklenir. Bunun ötesindeki kalite bu motorun değil, denetim noktasının meselesidir.
uk: Вікна, більші за навчене, все одно завантажуються. Якість поза ним залежить від контрольної точки, а не від цього рушія.
vi: Cửa sổ vượt mức đã huấn luyện vẫn tải được. Chất lượng ngoài mức đó là việc của checkpoint, không phải của engine này.
zh_hans: 超过训练窗口的设置仍可加载。超出部分的质量取决于检查点，而非本引擎。
zh_hant: 超過訓練視窗的設定仍可載入。超出部分的品質取決於檢查點，而非本引擎。

source: With a project attached, the model gets a persistent memory directory and a `memory` tool: it saves durable facts about you and the project as it learns them, and an index of what it remembers is always in its context. Memories live on disk, one folder per project. Type `#` followed by text to save one yourself, or /memory to open the folder.
ar: مع إرفاق مشروع، يحصل النموذج على دليل ذاكرة دائم وأداة `memory`: فهو يحفظ حقائق دائمة عنك وعن المشروع أثناء تعلمها، ويكون فهرس ما يتذكره موجودًا دائمًا في سياقه. تعيش الذكريات على القرص، مجلد واحد لكل مشروع. اكتب `#` متبوعًا بنص لحفظ واحدة بنفسك، أو /memory لفتح المجلد.
de: Wenn ein Projekt angehängt ist, erhält das Modell ein permanentes Speicherverzeichnis und ein `memory`-Tool: Es speichert dauerhafte Fakten über Sie und das Projekt, während es diese lernt, und ein Index seiner Erinnerungen ist immer in seinem Kontext. Erinnerungen befinden sich auf der Festplatte, ein Ordner pro Projekt. Geben Sie `#` gefolgt von Text ein, um selbst eine zu speichern, oder /memory, um den Ordner zu öffnen.
es: Con un proyecto adjunto, el modelo obtiene un directorio de memoria persistente y una herramienta `memory`: guarda datos duraderos sobre ti y el proyecto a medida que los aprende, y un índice de lo que recuerda está siempre en su contexto. Las memorias se almacenan en el disco, una carpeta por proyecto. Escribe `#` seguido de texto para guardar uno tú mismo, o /memory para abrir la carpeta.
fr: Avec un projet joint, le modèle dispose d'un répertoire de mémoire persistant et d'un outil `memory` : il enregistre des faits durables sur vous et le projet au fur et à mesure qu'il les apprend, et un index de ce dont il se souvient est toujours dans son contexte. Les souvenirs résident sur le disque, un dossier par projet. Tapez `#` suivi d'un texte pour en enregistrer un vous-même, ou /memory pour ouvrir le dossier.
he: כאשר פרויקט מצורף, המודל מקבל ספריית זיכרון קבועה וכלי `memory`: הוא שומר עובדות עמידות עליך ועל הפרויקט כשהוא לומד אותן, ואינדקס של מה שהוא זוכר תמיד נמצא בהקשר שלו. זיכרונות חיים בדיסק, תיקיה אחת לכל פרויקט. הקלד `#` ואחריו טקסט כדי לשמור אחד בעצמך, או /memory כדי לפתוח את התיקיה.
hi: एक परियोजना संलग्न होने के साथ, मॉडल को एक स्थायी मेमोरी निर्देशिका और एक `memory` टूल मिलता है: यह आपके और परियोजना के बारे में टिकाऊ तथ्यों को सीखता है और उन्हें सहेजता है, और जो कुछ भी याद रखता है उसका एक सूचकांक हमेशा इसके संदर्भ में होता है। यादें डिस्क पर रहती हैं, प्रति प्रोजेक्ट एक फ़ोल्डर। स्वयं को सहेजने के लिए `#` के बाद टेक्स्ट टाइप करें, या फ़ोल्डर खोलने के लिए /memory टाइप करें।
id: Dengan proyek terlampir, model mendapatkan direktori memori persisten dan alat `memory`: ia menyimpan fakta tahan lama tentang Anda dan proyek saat mempelajarinya, dan indeks dari apa yang diingatnya selalu ada dalam konteksnya. Memori hidup di disk, satu folder per proyek. Ketik `#` diikuti teks untuk menyimpannya sendiri, atau /memory untuk membuka folder.
it: Con un progetto allegato, il modello ottiene una directory di memoria persistente e uno strumento `memory`: salva informazioni durature su di te e sul progetto man mano che le apprende, e un indice di ciò che ricorda è sempre nel suo contesto. I ricordi risiedono su disco, una cartella per progetto. Digita `#` seguito dal testo per salvarne uno tu stesso, oppure /memory per aprire la cartella.
ja: プロジェクトがアタッチされると、モデルは永続メモリディレクトリと `memory` ツールを取得します。学習したあなたやプロジェクトに関する永続的なファクトを保存し、記憶したインデックスは常にコンテキスト内に保持されます。メモリはディスク上に存在し、プロジェクトごとに 1 つのフォルダになります。自分で保存するには `#` の後にテキストを入力するか、/memory を入力してフォルダを開きます。
ko: 프로젝트가 연결되면 모델은 영구 메모리 디렉터리와 `memory` 도구를 갖게 됩니다. 학습하면서 사용자와 프로젝트에 대한 지속적인 사실을 저장하며 기억하는 내용의 인덱스는 항상 컨텍스트에 포함됩니다. 메모리는 프로젝트당 하나의 폴더로 디스크에 저장됩니다. 직접 저장하려면 `#` 뒤에 텍스트를 입력하거나 /memory를 입력하여 폴더를 여세요.
nl: Wanneer een project is gekoppeld, krijgt het model een permanente geheugenmap en een `memory`-tool: het slaat duurzame feiten over u en het project op terwijl het deze leert, en een index van wat het zich herinnert bevindt zich altijd in de context. Herinneringen staan op de schijf, één map per project. Typ `#` gevolgd door tekst om er zelf een op te slaan, of /memory om de map te openen.
pl: Po dołączeniu projektu model otrzymuje trwały katalog pamięci i narzędzie `memory`: zapisuje trwałe fakty o Tobie i projekcie w miarę ich poznawania, a indeks tego, co pamięta, zawsze znajduje się w jego kontekście. Wspomnienia znajdują się na dysku, po jednym folderze na projekt. Wpisz `#`, a następnie tekst, aby zapisać wspomnienie samodzielnie, lub /memory, aby otworzyć folder.
pt_br: Com um projeto anexado, o modelo ganha um diretório de memória persistente e uma ferramenta `memory`: ele salva fatos duradouros sobre você e o projeto conforme os aprende, e um índice do que ele lembra está sempre em seu contexto. As memórias ficam no disco, uma pasta por projeto. Digite `#` seguido de texto para salvar uma você mesmo, ou /memory para abrir a pasta.
ru: При подключении проекта модель получает постоянный каталог памяти и инструмент `memory`: она сохраняет долговременные факты о вас и проекте по мере их изучения, а индекс запомненного всегда находится в ее контексте. Память хранится на диске, по одной папке на проект. Введите `#`, а затем текст, чтобы сохранить факт самостоятельно, или /memory, чтобы открыть папку.
sv: Med ett projekt bifogat får modellen en beständig minneskatalog och ett `memory`-verktyg: den sparar hållbara fakta om dig och projektet när den lär sig dem, och ett index över vad den kommer ihåg finns alltid i dess sammanhang. Minnen lever på disk, en mapp per projekt. Skriv `#` följt av text för att spara en själv, eller /memory för att öppna mappen.
tr: Bir proje eklendiğinde model, kalıcı bir bellek dizini ve bir `memory` aracı alır: öğrendikçe sizin ve proje hakkında kalıcı gerçekleri kaydeder ve hatırladıklarının bir dizini her zaman bağlamında yer alır. Anılar diskte, proje başına bir klasörde yaşar. Kendiniz bir tane kaydetmek için `#` ve ardından metin yazın veya klasörü açmak için /memory yazın.
uk: Коли проект прикріплено, модель отримує постійний каталог пам'яті та інструмент `memory`: вона зберігає довготривалі факти про вас і проект у міру їх вивчення, а покажчик того, що вона пам'ятає, завжди знаходиться в її контексті. Спогади зберігаються на диску, по одній папці на проект. Введіть `#`, а потім текст, щоб зберегти спогад власноруч, або /memory, щоб відкрити папку.
vi: Khi đính kèm một dự án, mô hình sẽ có một thư mục bộ nhớ liên tục và một công cụ `memory`: nó lưu các sự kiện lâu dài về bạn và dự án khi tìm hiểu chúng, đồng thời chỉ mục những gì nó ghi nhớ luôn nằm trong ngữ cảnh của nó. Kỷ niệm nằm trên đĩa, mỗi dự án một thư mục. Nhập `#` theo sau là văn bản để tự lưu một kỷ niệm hoặc /memory để mở thư mục.
zh_hans: 附加项目后，模型将获得一个持久记忆目录和一个 `memory` 工具：随着学习，它会保存关于你和项目的长期事实，并且其记忆索引始终存在于其上下文中。记忆保存在磁盘上，每个项目一个文件夹。输入 `#` 后跟文本可自行保存一条记忆，或输入 /memory 打开该文件夹。
zh_hant: 附加專案後，模型將獲得一個持久記憶目錄和一個 `memory` 工具：隨著學習，它會保存關於你和專案的長期事實，並且其記憶索引始終存在於其上下文中。記憶保存在磁碟上，每個專案一個資料夾。輸入 `#` 後跟文字可自行保存一條記憶，或輸入 /memory 開啟該資料夾。
